---
type: DuctInsulation
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 2
tags: [revit-api, class]
---

# DuctInsulation

`Autodesk.Revit.DB.Mechanical.DuctInsulation` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2012 | `public static DuctInsulation Create ( Document document , ElementId ductOrContentElementId , ElementId ductInsulationTypeId , double Thickness )` |
| Property | Parameter | — | `` |